[
    {
        "id": "598a5d8a-e2ae-4acf-801f-82a497a9cf0d",
        "title": "Kasa - site de logements",
        "url": "https://github.com/AmaryllisPittin/Kasa.git",
        "cover": "https://dl.dropboxusercontent.com/scl/fi/qyjv22fyrwhr4m11nqfr9/M_Fiche-Logement.webp?rlkey=t8acqk57ev07cnous7q71oasc&st=uqdqx04a&dl=0",
        "description1": "J'ai réalisé le site web de Kasa dans le cadre de ma formation OpenClassRooms, afin de comprendre le fonctionnement de React et React Router pour créer une expérience utilisateur moderne et réactive. Il s'agit d'une application de location immobilière, présentant les 20 dernières annonces de logements ainsi qu'une page 'A propos' pour renseigner les visiteurs sur le fonctionnement de l'organisme. J'ai réalisé la refonte totale du site à partir de React, React Router, Sass pour les animations et le style, ainsi que Json pour les données en Back-end.",
        "description2": "J'ai suivi pour le design les maquettes Figma fournies, autant pour le format desktop que mobile. L'entièreté du site est abordable sur tous les formats d'écrans, en sachant que de plus en plus d'utilisateurs visitent des sites web depuis leur portable. D'autre part, pour le contenu de ce projet, l'utilisateur de React Router a été indispensable pour l'accès vers chaque logement présenté sur la page.",
        "description3": "Le but de React Router est de transformer l'application en Single Page, ce qui signifie que le site et son contenu entier sont accessibles sur une seule page plutôt que plusieurs. L'avantage de ne pas à avoir à charger une nouvelle page selon l'action de l'utilisateur, de réduire la quantité de données à télécharger par l'utilisateur et donc de fluidifier son expérience ne sont pas à négliger. De plus, il est possible avec React Router de configurer les chemins d'URL pour les utilisateurs, et ce de plusieurs façons.",
        "tags": [
            "Projet OpenClassRooms",
            "React",
            "Sass"
        ]
    },
    {
        "id": "8a4fb6d0-34fe-4b67-af61-0675bfd3fd0a",
        "title": "Ohmyfood - site de restauration",
        "url": " https://amaryllispittin.github.io/Ohmyfood/",
        "cover": "https://dl.dropboxusercontent.com/scl/fi/4x3qr8sajfxcagtdjn8a6/ohmyfoodCover.webp?rlkey=3ul8lkojnoene5efen1fplvz0&st=28n9hclv&dl=0",
        "description1": "Ce projet, compris dans le parcours d'Intégrateur Web d'OpenClassRooms, a été pour moi un moyen de m'initier à Sass et au fonctionnement des animations. Il s'agit d'une application, en mobile-friendly, permettant aux utilisateurs de passer commande à distance auprès de restaurants gastronomiques. Le design a été conçu sur Figma, mais j'avais le choix du style des animations pourvu que le style corresponde à l'esthétique globale.",
        "description2": "Le travail sur ce site consistait à utiliser Html et Sass pour avoir un résultat responsive en partant d'une taille d'écran mobile (plus pratique pour les utilisateurs dans ce contexte), ainsi que des animations propres et designs pour chaque action des visiteurs.",
        "description3": "Si le Css me plaisait déjà beaucoup, j'ai vite compris que Sass allait m'amener à un autre niveau, celui de l'organisation structurée de mes fichiers de style ainsi qu'une grande possibilité d'animations qui rendent un site plus agréable et dynamique.",
        "tags": [
            "Projet OpenClassRooms",
            "Sass"
        ]
    },
    {
        "id": "e0ff9af8-606e-4b41-a4fb-1b9b3cedcadb",
        "title": "Luminescence - site commercial - casques audio",
        "url": "https://luminescence-com.vercel.app/",
        "cover": "https://dl.dropboxusercontent.com/scl/fi/z24p17ka6ellvf8pzxhiw/8-New-Super-Mario-Bros-2-World-6-Map-Theme-YouTube-Mozilla-Firefox-20_06_2024-16_52_47.png?rlkey=f29yc8mf9z0k1my3syvnwojkx&st=muffs7vm&dl=0",
        "description1": "Ceci est un petit projet, un simple projet qu'il m'a plu de développer avec simplicité pour présenter un exemple de petit site de e-commerce. Le but étant ici de montrer un exemple simple de ce qui pourrait être un site vitrine pour une marque. Bien sûr, toute information de ce site est factice, pour l'exemple.",
        "description2": "Il s'agit d'une présentation de Luminescence, une marque de casques audio. Ce projet a été bâtit avec grande simplicité, et donc sur des bases html et scss. Etant donné le peu de contenu, et le petit nombre de pages, j'ai simplement gardé cette structure avec simplement un seul fichier JavaScript pour gérer l'envoi des messages.",
        "description3": "Scss là aussi, m'a paru être une bonne option afin d 'avoir des fichiers de style organisées et propres. Chaque image du site a été créée grâce à une IA, Midjourney.",
        "tags": [
            "Projet Personnel",
            "Sass"
        ]
    },
    {
        "id": "66635c1e-e407-4fe5-9911-744c7bbd1978",
        "title": "TheraForma.fr - site de formations en psychologie",
        "url": "https://thera-forma-fr.vercel.app",
        "cover": "https://dl.dropboxusercontent.com/scl/fi/estf0vzkvft6gerv376dd/TheraForma.webp?rlkey=felq92fsb6ljq6l9gj53fxd7r&st=f99efdsq&dl=0",
        "description1": "Au départ, c eprojet était destiné à un organisme existant réellement. Mais lorsqu'il s'est avéré que des développeurs étaient déjà sur le projet, j'ai décidé de refaire une refonte de ce site pour un pseudo-organisme en psychologie: TheraForma.",
        "description2": "Ce site présente un organisme proposant des formations dans plusieurs centres, en France et à l'international, sur le thème de la psychologie. Des thérapies de groupe sont également proposées, et des livres y sont mis en vente. Le but est de présenter, mais aussi de rendre accessible des inscriptions pour les formations, quelles soient en ligne ou en présentiel.",
        "description3": "Le site en React montre une organisation un peu plus complexe qu'un simple site vitrine, et Scss est utilisé pour le style. Chaque image du site a été créée grâce à une IA, Midjourney.",
        "tags": [
            "Projet Personnel en cours",
            "Sass",
            "React"
        ]
    }
]